package ru.psu.techjava.application.services

import org.springframework.http.ResponseEntity
import ru.psu.techjava.application.model.CEmployee
import java.util.*
/********************************************************************************************************
 * Сервис с бизнес-логикой для работы со списком сотрудника.                                            *
 * @author Панин А.Р. 2022 1107.                                                                        *
 ********************************************************************************************************/
interface IServiceEmployee {
    /****************************************************************************************************
     * Список всех сотрудников.                                                                         *
     ****************************************************************************************************/
    fun getAll(): Iterable<CEmployee>
    /****************************************************************************************************
     * Поиск сотрудника по идентификатору.                                                              *
     * @param id - идентификатор сотрудника для поиска в формате UUID.                                  *
     ****************************************************************************************************/
    fun getById(id: UUID): ResponseEntity<CEmployee>
    fun getWithMaxCoefficient(): List<CEmployee>
    /****************************************************************************************************
     * Создание/изменение сотрудника.                                                                   *
     * @param employee - данные сотрудника.                                                             *
     ****************************************************************************************************/
    fun save(employee: CEmployee)
    /****************************************************************************************************
     * Удаление сотрудника.                                                                             *
     * @param employee - данные сотрудника.                                                             *
     ****************************************************************************************************/
    fun delete(employee: CEmployee)
    /****************************************************************************************************
     * Удаление сотрудника по идентификатору.                                                           *
     * @param id - идентификатор сотрудника для удаления.                                               *
     ****************************************************************************************************/
    fun deleteById(id: UUID): String

}