package ru.psu.techjava.application

import org.junit.jupiter.api.Assertions.assertEquals
import org.junit.jupiter.api.Test
import org.springframework.boot.test.context.SpringBootTest

/********************************************************************************************************
 * Класс с автоматическими тестами функционала общего назначения.                                       *
 * @author Панин А.Р. 2022 1107.                                                                        *
 ********************************************************************************************************/
@SpringBootTest
class CTestGeneral {

    /****************************************************************************************************
     * Пример тривиального теста.                                                                       *
     ****************************************************************************************************/
    @Test
    fun testMath() {
        assertEquals( 3, 1+2)
    }
}