package ru.psu.techjava.application.model

import com.fasterxml.jackson.annotation.JsonIncludeProperties
import java.util.*
import javax.persistence.*

@Entity
@Table(name = "department")
data class CDepartment (
    /****************************************************************************************************
     * Идентификатор.                                                                                   *
     ****************************************************************************************************/
    @Id
    var id: UUID? = null, //инициалируем уникальный id из 32 символов

    /****************************************************************************************************
     * Наименование.                                                                                    *
     ****************************************************************************************************/
    @Column
    var name: String? = null,

    /****************************************************************************************************
     * Руководитель.                                                                                    *
     ****************************************************************************************************/
    @OneToOne
    var depHead: CEmployee? = null,

    /****************************************************************************************************
     * Список должностей.                                                                               *
     ****************************************************************************************************/

    @OneToMany(mappedBy = "department")
    @JsonIncludeProperties(value = ["id","name","salary"])
    var position: MutableList<CPosition> = mutableListOf()
)